zacck/stm32f1xx_drivers/Src/main.c
/**
 ******************************************************************************
 * @file           : main.c
 * @author         : Auto-generated by STM32CubeIDE
 * @brief          : Main program body
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

#include "stm32f1xx.h"
#include "string.h"


int main(void){
	GPIO_Handle_t  GpioLed,GpioButton;

	//Enable the clock for port C
	GPIO_PCLK_CTRL(GPIOC, ENABLE);

	// lets make a handler for LED
	GpioLed.pGPIOx = GPIOC;
	GpioLed.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GpioLed.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_OUT_PP;
	GpioLed.GPIO_PinConfig.GPIO_PinDirection = GPIO_DIR_OUT_MEDIUM;

	// lets make a handler for External Button
	GpioButton.pGPIOx = GPIOB;
	GpioButton.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_5;
	GpioButton.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_IT_FT;
	GpioButton.GPIO_PinConfig.GPIO_PinDirection = GPIO_DIR_IN;



	//init the pin with the above handler
	GPIO_Init(&GpioLed);
	GPIO_Init(&GpioButton);
	GPIO_IRQPriorityConfig(IRQ_NO_EXTI9_5, NVIC_IRQ_PRIO15);
	GPIO_IRQConfig(IRQ_NO_EXTI9_5, ENABLE);

	SSD1306_Init();



	ssd1306_drawPixel(44, 50, 1);
	ssd1306_display();


	delay();

	ssd1306_drawPixel(60, 80, 1);
	ssd1306_display();


	delay();

	for(int x=0; x < SSD1306_COLUMNS; x++) {
		for(int y = 0; y < SSD1306_ROWS; y++){
			ssd1306_drawPixel(x, y, 1);
		}
	}
	ssd1306_display();


	delay();
	delay();

	ssd1306_drawPixel(64, 32, 0);
	ssd1306_display();
	ssd1306_clearDisplay();
	ssd1306_display();
	ssd1306_setCursorPosition(2, 0);
	ssd1306_display();
	ssd1306_drawChar('0');
	ssd1306_display();
	ssd1306_clearDisplay();
	SSD1306_DrawString("Broken Offset");
	ssd1306_display();




	while(1);


}

void EXTI9_5_IRQHandler (void) {
	//invoke irq handler
	GPIO_IRQHandling(GPIO_PIN_NO_5);
	GPIO_ToggleOutputPin(GPIOC, GPIO_PIN_NO_13);
	delay();
}


